import re
from datetime import datetime

ashana = [
    'Вентиляционная шахта-P1.14-Vв (32)',
    'Наклонный свод-P2.5-Vв (64)',
    'Наружняя стена-P2.6-ПТП (68)',
    'Вентиляционная шахта-P1.14-ТвОВв (31)',
    'Внешняя стена +2.5 м.-P1.13-ТвОВв (30)',
    'Наклонный свод-P2.5-ТвОВв (63)',
    'Наклонный свод-P2.5-Тп. (65)',
    'Наружняя стена-P2.6-ТвОВв (66)',
    'Наружняя стена-P2.6-Тп. (67)',
]
aqsaray_big = [
    'Вентиляционная шахта-P1.4-Vв (15)',
    'Наклонный свод-P2.3-Vв (58)',
    'Вентиляционная шахта-P1.4-ТвОВв (14)',
    'Наклонный свод-P2.3-ТвОВв (57)',
    'Наклонный свод-P2.3-Тп. (59)',
]
enter1 = [
    'Окно-P1.7-Vв (19)',
    'Окно-P1.7-ТвОВв (18)',
]
enter2 = [
    'Окно-P1.5-Vв (17)',
    'Окно-P1.5-ТвОВв (16)',
]
gurhana = [
    'Входная дверь-P1.19-Vв (42)',
    'Окно в коридор 4-P1.18-Vв (39)',
    'Входная дверь-P1.19-ТвОВв (41)',
    'Окно в коридор 4-P1.18-ТвОВв (38)',
    'Окно в коридор 4-P1.18-Тп. (40)',
]
qazandyq = [
    'Дверной проём главного входа-P1.24-НВ (100)',
    'Северо-восточная сторона-P1.12-Vв (29)',
    'Северо-западная сторона-P1.11-Vв (27)',
    'Юго-восточная сторона-P1.8-Vв (21)',
    'Юго-западная сторона-P1.9-Vв (23)',
    'Юго-западное окно-P1.10-Vв (25)',
    'Северо-восточная сторона-P1.12-ТвОВв (28)',
    'Северо-западная сторона-P1.11-ТвОВв (26)',
    'Юго-восточная сторона-P1.8-ТвОВв (20)',
    'Юго-западная сторона-P1.9-ТвОВв (22)',
    'Юго-западное окно-P1.10-ТвОВв (24)',
]
qazandyq_dome = [
    'Вершина (зен.отв)-P3.9-Vв (83)',
    'Вершина (зен.отв)-P3.9-ТвОВв (82)',
    'Север (внеш. +5 м.)-P3.8-ПТП (85)',
    'Север (внеш. +5 м.)-P3.8-Тп. (84)',
    'Север (внеш.)-P3.8-ПТП (80)',
    'Север (внеш.)-P3.8-Тп. (79)',
    'Север (внут.)-P3.8-ПТП (78)',
    'Север (внут.)-P3.8-Тп. (77)',
    'Север (центр +5 м.)-P3.8-Vв (92)',
    'Север (центр)-P3.8-Vв (81)',
    'Юг  (внеш. +5 м.)-P3.6-ПТП (87)',
    'Юг  (внеш. +5 м.)-P3.6-Тп. (86)',
    'Юг (внеш.)-P3.6-ПТП (75)',
    'Юг (внеш.)-P3.6-Тп. (74)',
    'Юг (внут.)-P3.6-Тп. (72)',
    'Юг (внут.)-P3.6-ПТП (73)',
    'Юг (центр +5 м.)-P3.6-Vв (91)',
    'Юг (центр)-P3.6-Vв (76)',
    'Север-P3.8-ТвОВв (93)',
    'Юг-P3.6-ТвОВв (95)',
    'Восток-P3.19-ТвОВв (97)',
    'Запад-P3.18-ТвОВв (96)',
]
library = [
    'Вентиляционная шахта-P1.15-Vв (34)',
    'Вентиляционная шахта-P1.15-ТвОВв (33)',
]
hall2 = [
    'Западный дверной проём-P1.27-Vв (106)',
    'Западный дверной проём-P1.27-НВ (103)',
    'Западный дверной проём-P1.27-ТвОВв (99)',
]
hall4 = [
    '+2.5 м.-P1.16-Vв (36)',
    '+2.5 м.-P1.17-Конц. СО2 (37)',
    '+2.5 м.-P1.16-ТвОВв (35)',
]
qydyqhana = [
    'Вентиляционная шахта-P1.2-Vв (10)',
    'Наклонный свод-P2.1-Vв (52)',
    'Оконный проём-P2.8-Vв (105)',
    'Оконный проём-P2.8-НВ (102)',
    'Вентиляционная шахта-P1.2-ТвОВв (9)',
    'Наклонный свод-P2.1-ТвОВв (51)',
    'Наклонный свод-P2.1-Тп. (53)',
    'Оконный проём-P2.8-ТвОВв (98)',
    'Стена-P1.1-Тп. (8)',
]
aqsaray_small = [
    'Вентиляционная шахта-P1.3-Vв (12)',
    'Наклонный свод-P2.2-Vв (55)',
    'Вентиляционная шахта-P1.3-ТвОВв (11)',
    'Вентиляционная шахта-P1.3-Тп. (13)',
    'Наклонный свод-P2.2-ТвОВв (54)',
    'Наклонный свод-P2.2-Тп. (56)',
]
room = [
    'Окно-P2.4-Vв (61)',
    'Окно-P2.4-ТвОВв (60)',
    'Окно-P2.4-Тп. (62)',
]
terrace = [
    'Окно-P2.4-Vв (61)',
    'Окно-P2.4-ТвОВв (60)',
    'Окно-P2.4-Тп. (62)',
]
hudjara = [
    'Окно-P2.7-ТвОВв (69)',
    'Окно-P2.7-Тп. (70)',
]
others = [
    'Северный угол-P3.3-Уровень шума (71)',
    'Восточный угол-P3.14-Угол наклона (3)',
    'Северный угол-P3.15-Угол наклона (4)',
    'Западный угол-P3.16-Угол наклона (6)',
    'Южный угол-P3.17-Угол наклона (5)',
    'Колодец возле мониторинг центра-P4.6-Уровень грунтовых вод (203)',
]
meteodata = [
    'Метео данные',
]


locations = {
    'Асхана': 'ashana',
    'Большой Аксарай': 'aqsaray_big',
    'Вход №1': 'enter1',
    'Вход №2': 'enter2',
    'Гурхана': 'gurhana',
    'Казандык': 'qazandyq',
    'Казандык. М-куп. пространство': 'qazandyq_dome',
    'Китапхана': 'library',
    'Коридор 2': 'hall2',
    'Коридор 4': 'hall4',
    'Кудукхана': 'qydyqhana',
    'Малый Аксарай': 'aqsaray_small',
    'Помещение 1': 'room',
    'Террасса 1 ': 'terrace',
    'Худжара 1': 'hudjara',
    'Прочие': 'others',
    'Данные метеостанции': 'meteodata',
}
sensors = {
    'Асхана': ashana,
    'Большой Аксарай': aqsaray_big,
    'Вход №1': enter1,
    'Вход №2': enter2,
    'Гурхана': gurhana,
    'Казандык': qazandyq,
    'Казандык. М-куп. пространство': qazandyq_dome,
    'Китапхана': library,
    'Коридор 2': hall2,
    'Коридор 4': hall4,
    'Кудукхана': qydyqhana,
    'Малый Аксарай': aqsaray_small,
    'Помещение 1': room,
    'Террасса 1 ': terrace,
    'Худжара 1': hudjara,
    'Прочие': others,
    'Данные метеостанции': meteodata,
}
sensor_names = [
    'Стена',
    '+2.5 м.',
    'Вентиляционная шахта',
    'Наклонный свод',
    'Наружняя стена',
    'Внешняя стена +2.5 м.',
    'Окно',
    'Входная дверь',
    'Окно в коридор',
    'Дверной проём главного входа',
    'Северо-восточная сторона',
    'Северо-западная сторона',
    'Юго-восточная сторона',
    'Юго-западная сторона',
    'Юго-западное окно',
    'Вершина (зен.отв)',
    'Север (внеш. +5 м.)',
    'Север (внеш.)',
    'Север (внут.)',
    'Север (центр +5 м.)',
    'Север (центр)',
    'Юг  (внеш. +5 м.)',
    'Юг (внеш.)',
    'Юг (внут.)',
    'Юг (центр +5 м.)',
    'Юг (центр)',
    'Север',
    'Юг',
    'Восток',
    'Запад',
    'Западный дверной проём',
    'Оконный проём',
    'Северный угол',
    'Восточный угол',
    'Западный угол',
    'Южный угол',
    'Колодец возле мониторинг центра',
    'Метео данные',
]
sensor_types = {
    'ТвОВв' : [("Температура", "'C"), ('Влажность', '%'), ('Точка росы', "'C")],
    'Vв': [('Скорость воздушного потока', 'м/с')],
    'ПТП': [('Плотность теплового поткока', 'Вт/м2')],
    'Тп.': [("Температура", "'C")],
    'НВ': [('Направление ветра', '(0-внутрь, 1-наружу)')],
    'Уровень шума': [('Уровень шума', 'дБ')],
    'Конц. СО2': [('Концентрация CO2', 'ppm')],
    'Уровень грунтовых вод': [('Уровень грунтовых вод', 'м'), ('Уровень заряда батареи', 'В')],
    'Угол наклона': [('Наклон по Х', 'град.'), ('Наклон по У', 'град.')],
    '': [
        ("Температура", "'C"),
        ('Точка росы', "'C"),
        ('Атмосферное давление', 'мм.рт.ст'),
        ('Влажность воздуха', '%'),
        ('Скорость ветра', 'м/с'),
        ('Направление ветра', 'град.'),
        ('Уровень осадков', 'мм')
    ]
}


def get_location_and_sensor_names(json_key):
    for location, sensor_list in sensors.items():
        for sensor in sensor_list:
            if json_key in sensor:
                return location, sensor
    return "", ""


def get_sensor_name(full_str):
    if '-P' not in full_str:
        return full_str
    result, _ = full_str.split('-P')
    return result


def get_sensor_spot(full_str):
    if '-P' not in full_str:
        return ''
    match = re.search(r"-P(.*?)-", full_str)
    return f'P{match.group(1)}'


def get_sensor_type(full_str):
    for t in sensor_types.keys():
        if t in full_str:
            return t
    return ''


def parse_dt(dt_str):
    for fmt in ("%Y-%m-%d %H:%M:%S.%f", "%Y-%m-%d %H:%M:%S"):
        try:
            dt = datetime.strptime(dt_str, fmt)
            return dt
        except ValueError:
            continue
    raise ValueError(f"Invalid datetime format: {dt_str}")


def safe_float(x):
    return float(x) if x is not None else None


def get_sensor_info(json_key):
    location, full_sensor_name = get_location_and_sensor_names(json_key)
    if location=="" and full_sensor_name=="":
        return {}
    name = get_sensor_name(full_sensor_name)
    spot = get_sensor_spot(full_sensor_name)
    t = get_sensor_type(full_sensor_name)
    types_signs = sensor_types[t]
    return {
        'location': location,
        'full_sensor_name': full_sensor_name,
        'name': name,
        'spot': spot,
        'types_signs': types_signs,
        'type': t
    }
