import re
from datetime import datetime
from functools import lru_cache

from django.utils import timezone

sensor_types = {
    'ТвОВв': [("Температура", "°C"), ('Влажность', '%'), ('Точка росы', "'C")],
    'Vв': [('Скорость воздушного потока', 'м/с')],
    'ПТП': [('Плотность теплового потока', 'Вт/м2')],
    'Тп.': [("Температура", "°C")],
    'НВ': [('Направление ветра', '(0-внутрь, 1-наружу)')],
    'Уровень шума': [('Уровень шума', 'дБ')],
    'Конц. СО2': [('Концентрация CO2', 'ppm')],
    'Уровень грунтовых вод': [('Уровень грунтовых вод', 'м'), ('Уровень заряда батареи', 'В')],
    'Угол наклона': [('Наклон по Х', 'град.'), ('Наклон по У', 'град.')],
    '': [
        ("Температура", "'C"),
        ('Точка росы', "'C"),
        ('Атмосферное давление', 'мм.рт.ст'),
        ('Влажность воздуха', '%'),
        ('Скорость ветра', 'м/с'),
        ('Направление ветра', 'град.'),
        ('Уровень осадков', 'мм')
    ]
}

webhook_keys = {
    'Окно-P1.5-Vв (17)': ('Вход №2', 'Окно-P1.5-Vв (17)'),
    'Окно-P1.5-ТвОВв (16)': ('Вход №2', 'Окно-P1.5-ТвОВв (16)'),

    'Окно-P1.7-Vв (19)': ('Вход №1', 'Окно-P1.7-Vв (19)'),
    'Окно-P1.7-ТвОВв (18)': ('Вход №1', 'Окно-P1.7-ТвОВв (18)'),

    'Окно-P2.4-Vв (61)': ('Помещение 1', "Окно-P2.4-Vв (61)"),
    'Окно-P2.4-ТвОВв (60)': ('Помещение 1', 'Окно-P2.4-ТвОВв (60)'),
    'Окно-P2.4-Тп. (62)': ('Помещение 1', "Окно-P2.4-Тп. (62)"),

    '+2.5 м.-P1.16-Vв (36)': ('Коридор 4', '+2.5 м.-P1.16-Vв (36)'),
    '+2.5 м.-P1.17-Конц. СО2 (37)': ('Коридор 4', '+2.5 м.-P1.17-Конц. СО2 (37)'),
    '+2.5 м.-P1.16-ТвОВв (35)': ('Коридор 4', '+2.5 м.-P1.16-ТвОВв (35)'),

    "Метео данные": ('Данные метеостанции', 'Метео данные'),

    'Окно-P3.13-Vв (89)': ('Террасса 1', 'Окно-P3.13-Vв (89)'),
    'Окно-P3.13-ТвОВв (88)': ('Террасса 1', 'Окно-P3.13-ТвОВв (88)'),
    'Окно-P3.13-Тп. (90)': ('Террасса 1', 'Окно-P3.13-Тп. (90)'),

    'Окно-P2.7-ТвОВв (69)': ('Худжара 1', 'Окно-P2.7-ТвОВв (69)'),
    'Окно-P2.7-Тп. (70)': ('Худжара 1', 'Окно-P2.7-Тп. (70)'),

    'Вентиляционная шахта-P1.2-Vв': ('Кудукхана', 'Вентиляционная шахта-P1.2-Vв (10)'),
    'Наклонный свод-P2.1-Vв (52)': ('Кудукхана', 'Наклонный свод-P2.1-Vв (52)'),
    'Оконный проём-P2.8-Vв (105)': ('Кудукхана', 'Оконный проём-P2.8-Vв (105)'),
    'Оконный проём-P2.8-НВ (102)': ('Кудукхана', 'Оконный проём-P2.8-НВ (102)'),
    'Вентиляционная шахта-P1.2-Тв': ('Кудукхана', 'Вентиляционная шахта-P1.2-ТвОВв (9)'),
    'Наклонный свод-P2.1-ТвОВв (5': ('Кудукхана', 'Наклонный свод-P2.1-ТвОВв (51)'),
    'Наклонный свод-P2.1-Тп. (53)': ('Кудукхана', 'Наклонный свод-P2.1-Тп. (53)'),
    'Оконный проём-P2.8-ТвОВв (98': ('Кудукхана', 'Оконный проём-P2.8-ТвОВв (98)'),
    'Стена-P1.1-Тп. (8)': ('Кудукхана', 'Стена-P1.1-Тп. (8)'),

    'Вершина (зен.отв)-P3.9-Vв (8': ('Казандык. М-куп. пространство', 'Вершина (зен.отв)-P3.9-Vв (83)'),
    'Вершина (зен.отв)-P3.9-ТвОВв': ('Казандык. М-куп. пространство', 'Вершина (зен.отв)-P3.9-ТвОВв (82)'),
    'Север (внеш. +5 м.)-P3.8-ПТП': ('Казандык. М-куп. пространство', 'Север (внеш. +5 м.)-P3.8-ПТП (85)'),
    'Север (внеш. +5 м.)-P3.8-Тп.': ('Казандык. М-куп. пространство', 'Север (внеш. +5 м.)-P3.8-Тп. (84)'),
    'Север (внеш.)-P3.8-ПТП (80)': ('Казандык. М-куп. пространство', 'Север (внеш.)-P3.8-ПТП (80)'),
    'Север (внеш.)-P3.8-Тп. (79)': ('Казандык. М-куп. пространство', 'Север (внеш.)-P3.8-Тп. (79)'),
    'Север (внут.)-P3.8-ПТП (78)': ('Казандык. М-куп. пространство', 'Север (внут.)-P3.8-ПТП (78)'),
    'Север (внут.)-P3.8-Тп. (77)': ('Казандык. М-куп. пространство', 'Север (внут.)-P3.8-Тп. (77)'),
    'Север (центр +5 м.)-P3.8-Vв ': ('Казандык. М-куп. пространство', 'Север (центр +5 м.)-P3.8-Vв (92)'),
    'Север (центр)-P3.8-Vв (81)': ('Казандык. М-куп. пространство', 'Север (центр)-P3.8-Vв (81)'),
    'Юг  (внеш. +5 м.)-P3.6-ПТП (': ('Казандык. М-куп. пространство', 'Юг  (внеш. +5 м.)-P3.6-ПТП (87)'),
    'Юг  (внеш. +5 м.)-P3.6-Тп. (': ('Казандык. М-куп. пространство', 'Юг  (внеш. +5 м.)-P3.6-Тп. (86)'),
    'Юг (внеш.)-P3.6-ПТП (75)': ('Казандык. М-куп. пространство', 'Юг (внеш.)-P3.6-ПТП (75)'),
    'Юг (внеш.)-P3.6-Тп. (74)': ('Казандык. М-куп. пространство', 'Юг (внеш.)-P3.6-Тп. (74)'),
    'Юг (внут.)-P3.6-Тп. (72)': ('Казандык. М-куп. пространство', 'Юг (внут.)-P3.6-Тп. (72)'),
    'Юг (внут.)-P3.6-ПТП (73)': ('Казандык. М-куп. пространство', 'Юг (внут.)-P3.6-ПТП (73)'),
    'Юг (центр +5 м.)-P3.6-Vв (91': ('Казандык. М-куп. пространство', 'Юг (центр +5 м.)-P3.6-Vв (91)'),
    'Юг (центр)-P3.6-Vв (76)': ('Казандык. М-куп. пространство', 'Юг (центр)-P3.6-Vв (76)'),
    'Север-P3.8-ТвОВв (93)': ('Казандык. М-куп. пространство', 'Север-P3.8-ТвОВв (93)'),
    'Юг-P3.6-ТвОВв (95)': ('Казандык. М-куп. пространство', 'Юг-P3.6-ТвОВв (95)'),
    'Восток-P3.19-ТвОВв (97)': ('Казандык. М-куп. пространство', 'Восток-P3.19-ТвОВв (97)'),
    'Запад-P3.18-ТвОВв (96)': ('Казандык. М-куп. пространство',  'Запад-P3.18-ТвОВв (96)'),

    'Лестница 4-P1.23-Vв (50)': ('Мечеть', 'Лестница 4-P1.23-Vв (50)'),
    'Окно купола юв-P3.20-Vв (47)': ('Мечеть', 'Окно купола юв-P3.20-Vв (47)'),
    'Окно купола юз-P3.21-Vв (44)': ('Мечеть', 'Окно купола юз-P3.21-Vв (44)'),
    'Оконный проём-P1.26-Vв (104)': ('Мечеть', 'Оконный проём-P1.26-Vв (104)'),
    'Северный дверной проём-P1.25': ('Мечеть', 'Северный дверной проём-P1.25-НВ (101)'),
    'Лестница 4-P3.23-ТвОВв (49)': ('Мечеть', 'Лестница 4-P3.23-ТвОВв (49)'),
    'Окно купола юв-P2.20-Тп. (48': ('Мечеть', 'Окно купола юв-P2.20-Тп. (48)'),
    'Окно купола юв-P3.20-ТвОВв (': ('Мечеть', 'Окно купола юв-P3.20-ТвОВв (46)'),
    'Окно купола юз-P3.21-ТвОВв (': ('Мечеть', 'Окно купола юз-P3.21-ТвОВв (43)'),
    'Окно купола юз-P3.21-Тп. (45': ('Мечеть', 'Окно купола юз-P3.21-Тп. (45)'),
    'Оконный проём-P1.26-ТвОВв (9': ('Мечеть', 'Оконный проём-P1.26-ТвОВв (94)'),

    'Входная дверь-P1.19-Vв (42)': ('Гурхана', 'Входная дверь-P1.19-Vв (42)'),
    'Окно в коридор 4-P1.18-Vв (3': ('Гурхана', 'Окно в коридор 4-P1.18-Vв (39)'),
    'Входная дверь-P1.19-ТвОВв (4': ('Гурхана', 'Входная дверь-P1.19-ТвОВв (41)'),
    'Окно в коридор 4-P1.18-ТвОВв': ('Гурхана', 'Окно в коридор 4-P1.18-ТвОВв (38)'),
    'Окно в коридор 4-P1.18-Тп. (': ('Гурхана', 'Окно в коридор 4-P1.18-Тп. (40)'),

    'Вентиляционная шахта-P1.14-V': ('Асхана', 'Вентиляционная шахта-P1.14-Vв (32)'),
    'Наклонный свод-P2.5-Vв (64)': ('Асхана', 'Наклонный свод-P2.5-Vв (64)'),
    'Наружняя стена-P2.6-ПТП (68)': ('Асхана', 'Наружняя стена-P2.6-ПТП (68)'),
    'Вентиляционная шахта-P1.14-Т': ('Асхана', 'Вентиляционная шахта-P1.14-ТвОВв (31)'),
    'Внешняя стена +2.5 м.-P1.13-': ('Асхана', 'Внешняя стена +2.5 м.-P1.13-ТвОВв (30)'),
    'Наклонный свод-P2.5-ТвОВв (6': ('Асхана', 'Наклонный свод-P2.5-ТвОВв (63)'),
    'Наклонный свод-P2.5-Тп. (65)': ('Асхана', 'Наклонный свод-P2.5-Тп. (65)'),
    'Наружняя стена-P2.6-ТвОВв (6': ('Асхана', 'Наружняя стена-P2.6-ТвОВв (66)'),
    'Наружняя стена-P2.6-Тп. (67)': ('Асхана', 'Наружняя стена-P2.6-Тп. (67)'),

    'Вентиляционная шахта-P1.3-Vв': ('Малый Аксарай', 'Вентиляционная шахта-P1.3-Vв (12)'),
    'Наклонный свод-P2.2-Vв (55)': ('Малый Аксарай', 'Наклонный свод-P2.2-Vв (55)'),
    'Вентиляционная шахта-P1.3-Тв': ('Малый Аксарай', 'Вентиляционная шахта-P1.3-ТвОВв (11)'),
    'Вентиляционная шахта-P1.3-Тп': ('Малый Аксарай', 'Вентиляционная шахта-P1.3-Тп. (13)'),
    'Наклонный свод-P2.2-ТвОВв (5': ('Малый Аксарай', 'Наклонный свод-P2.2-ТвОВв (54)'),
    'Наклонный свод-P2.2-Тп. (56)': ('Малый Аксарай', 'Наклонный свод-P2.2-Тп. (56)'),

    'Вентиляционная шахта-P1.4-Vв': ('Большой Аксарай', 'Вентиляционная шахта-P1.4-Vв (15)'),
    'Наклонный свод-P2.3-Vв (58)': ('Большой Аксарай', 'Наклонный свод-P2.3-Vв (58)'),
    'Вентиляционная шахта-P1.4-Тв': ('Большой Аксарай', 'Вентиляционная шахта-P1.4-ТвОВв (14)'),
    'Наклонный свод-P2.3-ТвОВв (5': ('Большой Аксарай', 'Наклонный свод-P2.3-ТвОВв (57)'),
    'Наклонный свод-P2.3-Тп. (59)': ('Большой Аксарай', 'Наклонный свод-P2.3-Тп. (59)'),

    'Дверной проём главного входа': ('Казандык', 'Дверной проём главного входа-P1.24-НВ (100)'),
    "Северо-восточная сторона-P1.": ('Казандык', 'Северо-восточная сторона-P1.12-Vв (29)'),
    "Северо-западная сторона-P1.1": ('Казандык', 'Северо-западная сторона-P1.11-Vв (27)'),
    'Юго-восточная сторона-P1.8-V': ('Казандык', 'Юго-восточная сторона-P1.8-Vв (21)'),
    'Юго-западная сторона-P1.9-Vв': ('Казандык', 'Юго-западная сторона-P1.9-Vв (23)'),
    'Юго-западное окно-P1.10-Vв (': ('Казандык', 'Юго-западное окно-P1.10-Vв (25)'),
    'Северо-восточная сторона-P1.1': ('Казандык', 'Северо-восточная сторона-P1.12-ТвОВв (28)'),
    'Северо-западная сторона-P1.11': ('Казандык', 'Северо-западная сторона-P1.11-ТвОВв (26)'),
    'Юго-восточная сторона-P1.8-Т': ('Казандык', 'Юго-восточная сторона-P1.8-ТвОВв (20)'),
    'Юго-западная сторона-P1.9-Тв': ('Казандык', 'Юго-западная сторона-P1.9-ТвОВв (22)'),
    'Юго-западное окно-P1.10-ТвОВ': ('Казандык', 'Юго-западное окно-P1.10-ТвОВв (24)'),

    'Вентиляционная шахта-P1.15-V': ('Китапхана', 'Вентиляционная шахта-P1.15-Vв (34)'),
    'Вентиляционная шахта-P1.15-Т': ('Китапхана', 'Вентиляционная шахта-P1.15-ТвОВв (33)'),

    'Северный угол-P3.3-Уровень ш': ('Прочие', 'Северный угол-P3.3-Уровень шума (71)'),
    'Восточный угол-P3.14-Угол на': ('Прочие', 'Восточный угол-P3.14-Угол наклона (3)'),
    'Северный угол-P3.15-Угол нак': ('Прочие', 'Северный угол-P3.15-Угол наклона (4)'),
    'Западный угол-P3.16-Угол нак': ('Прочие', 'Западный угол-P3.16-Угол наклона (6)'),
    'Южный угол-P3.17-Угол наклон': ('Прочие', 'Южный угол-P3.17-Угол наклона (5)'),
    'Колодец возле мониторинг цен': ('Прочие', 'Колодец возле мониторинг центра-P4.6-Уровень грунтовых вод (203)'),

    'Западный дверной проём-P1.27': ('Коридор 2', 'Западный дверной проём-P1.27-Vв (106)'),
    'Западный дверной проём-P1.271': ('Коридор 2', 'Западный дверной проём-P1.271-НВ (103)'),
    'Западный дверной проём-P1.272': ('Коридор 2', 'Западный дверной проём-P1.272-ТвОВв (99)'),
}


@lru_cache
def get_location_and_sensor_names(json_key):
    for key, value in webhook_keys.items():
        if json_key == key:
            return value[0], value[1]
    return "", ""


@lru_cache
def get_sensor_name(full_str):
    if '-P' not in full_str:
        return full_str
    result, _ = full_str.split('-P')
    return result


@lru_cache
def get_sensor_spot(full_str):
    if '-P' not in full_str:
        return ''
    match = re.search(r"-P(.*?)-", full_str)
    return f'P{match.group(1)}'


@lru_cache
def get_sensor_type(full_str):
    for t in sensor_types.keys():
        if t in full_str:
            return t
    return ''


def parse_dt(dt_str):
    for fmt in ("%Y-%m-%d %H:%M:%S.%f", "%Y-%m-%d %H:%M:%S"):
        try:
            dt = datetime.strptime(dt_str, fmt)
            return timezone.make_aware(dt)
        except ValueError:
            continue
    raise ValueError(f"Invalid datetime format: {dt_str}")


def safe_float(x):
    return float(x) if x is not None else None


@lru_cache
def get_sensor_info(json_key):
    location, full_sensor_name = get_location_and_sensor_names(json_key)
    if location == "" and full_sensor_name == "":
        return {}
    name = get_sensor_name(full_sensor_name)
    spot = get_sensor_spot(full_sensor_name)
    t = get_sensor_type(full_sensor_name)
    types_signs = sensor_types[t]
    return {
        'location': location,
        'full_sensor_name': full_sensor_name,
        'name': name,
        'spot': spot,
        'types_signs': types_signs,
        'type': t
    }


@lru_cache
def get_sensor_types(key):
    return sensor_types.get(key, [])